Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: It is possible to change the output format of the console log. This can be useful in environments where the output of the Quarkus application is captured by a service which can, for example, process and store the log information for later analysis.
ja_jp: コンソールログの出力形式を変更することができます。これは、Quarkusアプリケーションの出力がサービスによってキャプチャされ、例えば、後で分析するためにログ情報を処理して保存することができる環境で有用です。

source: It is possible to configure multiple policy enforcer configurations, one per each tenant, similarly to how it can be done for xref:security-openid-connect-multitenancy.adoc[Multi-Tenant OpenID Connect Service Applications].
ja_jp: xref:security-openid-connect-multitenancy.adoc[マルチテナントOpenID Connectサービスアプリケーション] の場合と同様に、各テナントごとに複数のポリシーエンフォースメント構成を設定することができます。

source: It is possible to configure some aspects of class loading in dev and test mode. This can be done using `application.properties`. Note that class loading config is different to normal config, in that it does not use the standard Quarkus config mechanisms (as it is needed too early), so only supports `application.properties`. The following options are supported.
ja_jp: 開発モードとテストモードでクラスローディングのいくつかの側面を設定することができます。これは、 `application.properties` を使用して行うことができます。クラスローディングの設定は通常の設定とは異なり、標準のQuarkusの設定メカニズムを使用していないため（必要な時期が早すぎるため）、 `application.properties` のみをサポートしていることに注意してください。以下のオプションがサポートされています。

source: It is possible to create a custom `Converter` type as specified by link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/converters.asciidoc#adding-custom-converters[MicroProfile Config].
ja_jp: link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/converters.asciidoc#adding-custom-converters[MicroProfile Config]で指定されたカスタム `Converter` 型を作成することが可能です。

source: It is possible to create an instance of `io.smallrye.mutiny.Uni` as follows:
ja_jp: 以下のように、 `io.smallrye.mutiny.Uni` のインスタンスを作成することができます:

source: It is possible to create different entry command for each profile, using `@IfBuildProfile`:
ja_jp: `@IfBuildProfile` を使用して、プロファイルごとに異なるエントリーコマンドを作成することができます。

source: It is possible to define custom implementations of the `RequestClassifier` interface. The implementations must be CDI beans, otherwise they are ignored. The CDI rules of typesafe resolution must be followed. That is, if multiple implementations exist with a different `@Priority` value and some of them are ``@Alternative``s, only the alternatives with the highest priority value are retained. If no implementation is an alternative, all implementations are retained and are sorted in descending `@Priority` order (highest priority value comes first).
ja_jp: `RequestClassifier` インターフェイスのカスタム実装を定義することが可能です。 実装は CDI Bean である必要があり、そうでない場合は無視されます。 typesafe な解決の CDI ルールに従う必要があります。 つまり、異なる `@Priority` 値を持つ複数の実装が存在し、そのうちのいくつかが ``@Alternative`` である場合、最も高い優先度値を持つ代替実装のみが保持されます。 代替実装となる実装がない場合、すべての実装が保持され、 `@Priority` の降順で並べ替えられます (最も高い優先度の値が最初になります)。

source: It is possible to define custom implementations of the `RequestPrioritizer` interface. The implementations must be CDI beans, otherwise they are ignored. The CDI rules of typesafe resolution must be followed. That is, if multiple implementations exist with a different `@Priority` value and some of them are ``@Alternative``s, only the alternatives with the highest priority value are retained. If no implementation is an alternative, all implementations are retained and are sorted in descending `@Priority` order (highest priority value comes first).
ja_jp: `RequestPrioritizer` インターフェイスのカスタム実装を定義することが可能です。 実装は CDI Bean である必要があり、そうでない場合は無視されます。 typesafe な解決の CDI ルールに従う必要があります。 つまり、異なる `@Priority` 値を持つ複数の実装が存在し、そのうちのいくつかが ``@Alternative`` である場合、最も高い優先度値を持つ代替実装のみが保持されます。 代替実装となる実装がない場合、すべての実装が保持され、 `@Priority` の降順で並べ替えられます (最も高い優先度の値が最初になります)。

source: It is possible to define multiple persistence units using the Quarkus configuration properties.
ja_jp: Quarkusの設定プロパティーを使用して複数の永続化ユニットを定義することができます。

source: It is possible to deploy images hosted on Docker Hub, but this location by default leaves images accessible to anyone. To better protect your container images, this guide shows how to host your images on a private instance of the Azure Container Registry service.
ja_jp: Docker Hub上にホストされたイメージをデプロイすることは可能ですが、この場所はデフォルトでは誰でもイメージにアクセスできる状態になっています。コンテナーイメージをよりよく保護するために、このガイドでは、Azure Container Registry サービスのプライベートインスタンス上でイメージをホストする方法を示します。

source: It is possible to disable the HTTP port and only support secure requests. This is done via the `quarkus.http.insecure-requests` property in `application.properties`. There are three possible values:
ja_jp: HTTP ポートを無効にして、セキュアなリクエストのみをサポートすることも可能です。これは `application.properties` の `quarkus.http.insecure-requests` プロパティーで行います。3 つの値を利用できます。

source: It is possible to generate resources using extensions, in some scenarios you need to generate a resource into `META-INF` directory, the resource can be a service for SPI or a simple HTML, CSS, Javascript files.
ja_jp: エクステンションを使用してリソースを生成することは可能ですが、シナリオによっては、リソースを `META-INF` ディレクトリーに生成する必要があります。このリソースは、SPI のサービス、または単純な HTML、CSS、Javascript ファイルになります。

source: It is possible to have multiple main methods in an application, and select between them at build time. The `@QuarkusMain` annotation takes an optional 'name' parameter, and this can be used to select the main to run using the `quarkus.package.main-class` build time configuration option. If you don't want to use annotations this can also be used to specify the fully qualified name of a main class.
ja_jp: アプリケーション内に複数のmainメソッドを持ち、ビルド時にそれらの間で選択することが可能です。 `@QuarkusMain` アノテーションはオプションの 'name' パラメーターを取り、 `quarkus.package.main-class` ビルド時設定オプションを使用して実行するmainを選択するために使用できます。アノテーションを使用したくない場合は、メインクラスの完全修飾名を指定するために使用することもできます。

source: It is possible to hide/remove classes and resources from dependencies. This is an advanced option, but it can be useful at times. This is done via the `quarkus.class-loading.removed-resources` config key, for example:
ja_jp: クラスやリソースを依存関係から隠したり、削除したりすることができます。これは上級者向けのオプションですが、ときには便利なこともあります。これは、 `quarkus.class-loading.removed-resources` 設定キーで行うことが可能です。例:

source: It is possible to inject beans from our test deployment directly into the test case
ja_jp: テストデプロイメントからテストケースに直接 Bean を注入することが可能です。

source: It is possible to inject the arguments that were passed in on the command line:
ja_jp: コマンドラインで渡された引数を注入することができます:

source: It is possible to instruct Quarkus to optionally apply the generated native image configuration files into subsequent native image processes, by setting the -Dquarkus.native.agent-configuration-apply` property. This can be useful to verify that the native integration tests work as expected, assuming that the JVM unit tests have generated the correct native image configuration. The typical workflow here would be to first run the integration tests with the native image agent as shown in the previous section:
ja_jp: Quarkus に、生成されたネイティブイメージ設定ファイルを後続のネイティブイメージプロセスにオプションで適用するように指示できます。 -Dquarkus.native.agent-configuration-apply` プロパティーを設定します。 JVM ユニットテストによって正しいネイティブイメージ設定が生成されたと想定した場合に、予想どおりにネイティブ結合テストが動作するかどうかを確認するのに役立ちます。 ここでの一般的なワークフローとして、前のセクションに示したように、まずネイティブイメージエージェントを使用して結合テストを実行します。

source: It is possible to invoke a bean method from a <<bytecode-recording,recorder method>> though. If you need to access a bean in a `@Record(STATIC_INIT)` build step then is must either depend on the `BeanContainerBuildItem` or wrap the logic in a `BeanContainerListenerBuildItem`. The reason is simple - we need to make sure the CDI container is fully initialized and started. However, it is safe to expect that the CDI container is fully initialized and running in a `@Record(RUNTIME_INIT)` build step. You can obtain a reference to the container via `CDI.current()` or Quarkus-specific `Arc.container()`.
ja_jp: ただし、<<bytecode-recording,レコーダーメソッド>> から Bean メソッドを呼び出すことは可能です。 `@Record(STATIC_INIT)` ビルドステップで Bean にアクセスする必要がある場合は、 `BeanContainerBuildItem` に依存するか、 `BeanContainerListenerBuildItem` 内にロジックをラップする必要があります。 理由は簡単で、CDI コンテナーが完全に初期化され、起動していることを確認する必要があるためです。 一方、 `@Record(RUNTIME_INIT)` ビルドステップでは、CDI コンテナーが完全に初期化され、動作していると想定しても安全です。 コンテナーへの参照は、 `CDI.current()` または Quarkus 固有の `Arc.container()` を使用して取得できます。

source: It is possible to mark a synthetic bean to be initialized during `RUNTIME_INIT`. See the <<writing-extensions.adoc#bootstrap-three-phases,Three Phases of Bootstrap and Quarkus Philosophy>> for more information about the difference between `STATIC_INIT` and `RUNTIME_INIT`.
ja_jp: `RUNTIME_INIT` の間に初期化される合成 Bean をマークできます。 `STATIC_INIT` と `RUNTIME_INIT` の違いの詳細については、<<writing-extensions.adoc#bootstrap-three-phases,Three Phases of Bootstrap and Quarkus Philosophy>> を参照してください。

source: It is possible to mock CDI beans by leveraging xref:getting-started-testing.adoc#testing_different_profiles[test profiles] though.
ja_jp: xref:getting-started-testing.adoc#testing_different_profiles[テストプロファイル] を活用することで、CDI Beanのモックを作成することが可能です。

source: It is possible to obtain information about the decorated bean by using the `@Decorated` qualifier.
ja_jp: `@Decorated` 修飾子を使用すると、装飾された Bean に関する情報を取得できます。

source: It is possible to only include a given `@BuildStep` under certain conditions. The `@BuildStep` annotation has two optional parameters: `onlyIf` and `onlyIfNot`. These parameters can be set to one or more classes which implement `BooleanSupplier`. The build step will only be included when the method returns `true` (for `onlyIf`) or `false` (for `onlyIfNot`).
ja_jp: 特定の条件下では、特定の `@BuildStep` のみを含めることができます。 `@BuildStep` アノテーションには、 `onlyIf` と `onlyIfNot` の 2 つのオプションパラメーターがあります。これらのパラメーターは、 `BooleanSupplier` を実装する 1 つ以上のクラスに設定できます。ビルドステップは、メソッドが `true` (`onlyIf` の場合) または `false` (`onlyIfNot` の場合) を返す場合にのみ含まれます。

source: It is possible to prevent an operation from being executed too often using a _rate limit_. Rate limits enforce a maximum number of permitted invocations in a time window of some length. For example, with a rate limit, one can make sure that a method may only be called 50 times per minute. Invocations that would exceed the limit are rejected with an exception of type `RateLimitException`.
ja_jp: ある操作が過剰に実行されるのを防ぐために、_流量制御_ を使用できます。流量制御は、一定の時間枠内で許可される最大呼び出し回数を制限します。たとえば、流量制御を使用すると、あるメソッドが 1分間に最大 50 回までしか呼び出されないように制御できます。制限を超える呼び出しは拒否され、`RateLimitException` 型の例外がスローされます。

source: It is possible to read annotations from the test class or method to control what the callback shall be doing.
ja_jp: テストクラスやメソッドからアノテーションを読み込んで、コールバックが何をするかを制御することができます。

source: It is possible to run continuous testing without starting dev mode. This can be useful if dev mode will interfere with your tests (e.g. running wiremock on the same port), or if you only want to develop using tests. To start continuous testing mode run `mvn quarkus:test`.
ja_jp: devモードを起動せずに、継続的なテストを行うことができます。これは、開発モードがテストの妨げになる場合 (同じポートで wiremock を実行している場合など) や、テストだけを使って開発したい場合などに便利です。継続的テストモードを開始するには、 `mvn quarkus:test` を実行します。

source: It is possible to run continuous testing without starting dev mode. This can be useful if dev mode will interfere with your tests (e.g. running wiremock on the same port), or if you only want to develop using tests. To start continuous testing mode, run `mvn quarkus:test` or `gradle quarkusTest`.
ja_jp: 開発モードを起動せずに継続的にテストを実行することも可能です。 これは、dev モードがテストの邪魔になる場合 (たとえば wiremock を同じポートで実行している場合など) や、テストだけを使用して開発したい場合に便利です。 継続的テストモードを開始するには、 `mvn quarkus:test` あるいは `gradle quarkusTest` を実行します。

source: It is possible to run or debug a Quarkus application from the IDE configurations. Select the `Run -> Edit Configurations...` menu and click the `Add new...` link:
ja_jp: IDE構成からQuarkusアプリケーションを実行またはデバッグすることができます。 `Run → Edit Configurations…​` メニューを選択し、 `Add new…​` リンクをクリックします。

source: It is possible to specify `onlyIfNot` conditions as well. . Conditions can also be set for required capabilities.
ja_jp: `onlyIfNot` の条件も指定することが可能です。.必要なケイパビリティに対して条件を設定することも可能です。

source: It is possible to specify `onlyIfNot` conditions as well. Conditions can also be set for required capabilities.
ja_jp: `onlyIfNot` の条件を指定することも可能です。必要なケイパビリティに対して条件を設定することも可能です。

source: It is possible to use <<when_operators,an operator>> to specify the matching logic. Unlike in the <<if_section>> nested operators are not supported.
ja_jp: <<when_operators,an operator>> を使用して、一致するロジックを指定できます。 <<if_section>> とは異なり、ネストされた演算子はサポートされません。

source: It is possible to use annotations to select an authentication mechanism specific to each Jakarta REST endpoint. This feature is only enabled when <<proactive-auth>> is disabled due to the fact that the annotations can only be used to select authentication mechanisms after a REST endpoint has been matched. Here is how you can select an authentication mechanism per a REST endpoint basis:
ja_jp: アノテーションを使用して、各 Jakarta REST エンドポイントに固有の認証メカニズムを選択できます。 この機能は、REST エンドポイントが一致した後にのみ、 認証メカニズムを選択するためにアノテーションを使用できることから、<<proactive-auth>> が無効化されている場合に限り、有効化されます。 REST エンドポイントごとに認証メカニズムを選択する方法は次のとおりです。

source: It is possible to use development mode remotely, so that you can run Quarkus in a container environment (such as OpenShift) and have changes made to your local files become immediately visible.
ja_jp: 開発モードをリモートで使用することができるので、コンテナー環境(OpenShiftなど)でQuarkusを実行して、ローカルファイルに加えられた変更をすぐに確認できるようにすることができます。

source: It is possible to use xref:when_operators[an operator] to specify the matching logic. Unlike in the xref:if_section[If Section] nested operators are not supported.
ja_jp: xref:when_operators[演算子] を用いてマッチングロジックを指定することが可能です。 xref:if_section[Ifセクション] とは異なり、入れ子の演算子はサポートされていません。

source: It is possible to write a textual explanation for the documentation default value, this is useful when it is generated: `@ConfigDocDefault("explain how this is generated")`.
ja_jp: ドキュメントのデフォルト値についてテキストによる説明を記述することが可能です。これは、ドキュメントが生成されるときに役立ちます: `@ConfigDocDefault("explain how this is generated")`

source: It is possible to write test resources that are enabled and configured using annotations. This is enabled by placing the `@QuarkusTestResource` on an annotation which will be used to enable and configure the test resource.
ja_jp: アノテーションを使用して有効化および設定されたテストリソースを作成することができます。これは、テストリソースの有効化と設定に使用されるアノテーション に `@QuarkusTestResource` を配置することで可能になります。

source: It is probably useless but we kindly remind you that you must not store clear-text passwords in production environment ;-). The `elytron-security-jdbc` offers a built-in bcrypt password mapper.
ja_jp: おそらく無用と思いますが、本番環境ではクリアテキストのパスワードを保存してはいけないことをご注意ください ;-)。 `elytron-security-jdbc` は組み込みの bcrypt パスワードマッパーを提供しています。

source: It is probably useless but we kindly remind you that you must not store clear-text passwords in production environments ;-). As a result, the `security-jpa` defaults to using bcrypt-hashed passwords.
ja_jp: おそらく役に立たないと思いますが、本番環境ではクリアテキストのパスワードを保存してはいけないことをご注意ください。)その結果、 `security-jpa` はデフォルトで bcrypt でハッシュ化されたパスワードを使用するようになりました。

source: It is probably useless, but we kindly remind you that you must not store clear-text passwords in production environment ;-). The `elytron-security-jdbc` offers a built-in bcrypt password mapper.
ja_jp: おそらく無用と思いますが、本番環境ではクリアテキストのパスワードを保存してはいけないことをご注意ください ;-)。 `elytron-security-jdbc` は組み込みの bcrypt パスワードマッパーを提供しています。

source: It is recommended that a Java main perform very little logic, and just launch the application main. In development mode the Java main will run in a different ClassLoader to the main application, so may not behave as you would expect.
ja_jp: Java mainはほとんどロジックを実行せず、アプリケーション mainを起動するだけにすることをお勧めします。開発モードでは、Java mainはアプリケーション mainとは異なるClassLoaderで実行されるので、期待通りの動作をしないかもしれません。

source: It is recommended to disable these instrumentations if you are using the Micrometer extension as well.
ja_jp: Micrometer エクステンションも使用している場合は、これらの計装を無効にすることを推奨します。

source: It is recommended to disable these instrumentations if you are using the `quarkus-micrometer` or the `quarkus-micrometer-opentelemetry` extensions as well.
ja_jp: また、`quarkus-micrometer` または `quarkus-micrometer-opentelemetry` エクステンションを使用している場合は、これらの計装を無効にすることをお勧めします。

source: It is recommended to encrypt any sensitive data, such as the `quarkus.mailer.password`. One approach is to save the value into a secure store like HashiCorp Vault, and refer to it from the configuration. Assuming for instance that Vault contains key `mail-password` at path `myapps/myapp/myconfig`, then the mailer extension can be simply configured as:
ja_jp: `quarkus.mailer.password` のような機密データは暗号化することをお勧めします。一つの方法として、HashiCorp Vaultのような安全なストアに値を保存し、設定からそれを参照することができます。例えば、Vaultがパス `myapps/myapp/myconfig` にキー `mail-password` を含んでいるとすると、Mailerエクステンションは次のように簡単に設定できます。

source: It is recommended to package the `proto` files in a dependency instead of the generated classes, so Quarkus can generate optimized classes. Refer to the <<scan-for-proto, dedicated section>> for more information.
ja_jp: Quarkus が最適化されたクラスを生成できるように、生成されたクラスではなく依存関係で `proto` ファイルをパッケージ化することを推奨します。 詳細は、<<scan-for-proto, dedicated section> を参照してください。

source: It is recommended to use exactly-once processing along with the batch consumption mode. While it is possible to use it with a single Kafka message, it'll have a significant performance impact.
ja_jp: バッチ消費モードと一緒に exactly-once 処理を使用することが推奨されます。単一の Kafka メッセージで使用することは可能ですが、パフォーマンスに大きな影響を与えることになります。

source: It is recommended you use SSL when using remote dev mode, however even if you are using an unencrypted connection your password is never sent directly over the wire. For the initial connection request the password is hashed with the initial state data, and subsequent requests hash it with a random session id generated by the server and any body contents for POST requests, and the path for DELETE requests, as well as an incrementing counter to prevent replay attacks.
ja_jp: リモート開発モードを使用する際には SSL を使用することを推奨しますが、たとえ暗号化されていない接続を使用していても、パスワードが直接ネットワーク上で送信されることはありません。最初の接続リクエストでは、パスワードは初期状態のデータでハッシュ化され、それ以降のリクエストでは、サーバーによって生成されたランダムなセッションIDと、POSTリクエストのためのボディコンテンツ、DELETEリクエストのためのパス、そしてリプレイ攻撃を防ぐためのインクリメントカウンタでハッシュ化されます。

source: It is recommended, that you have read the link:{quickstarts-tree-url}/kafka-quickstart[Kafka quickstart] before.
ja_jp: link:{quickstarts-tree-url}/kafka-quickstart[Kafkaのクイックスタート] を読んでおくことをお勧めします。

source: It is recommended, that you have read the {quickstarts-tree-url}/kafka-quickstart[Kafka quickstart] before.
ja_jp: 事前に {quickstarts-tree-url}/kafka-quickstart[Kafka quickstart] を読んでおくことをお勧めします。

source: It is required because `quarkus-oidc` expects that not only `access` and `refresh` tokens but also `IdToken` will be returned once the authorization code flow completes.
ja_jp: これは `quarkus-oidc` が、認可コードフローが完了したら `access` と `refresh` トークンだけでなく `IdToken` も返すことを想定しているためです。

source: It is required that implementations be valid `@ApplicationScoped` CDI beans.
ja_jp: 実装は有効な `@ApplicationScoped` CDI Beanであることが要求されます。

source: It is simpler than using `quarkus.oidc.authentication.scopes` to add a new scope, because `quarkus.oidc.authentication.scopes` overrides the scopes already set by the provider declaration, which is why you need to list all the required scopes in this case:
ja_jp: `quarkus.oidc.authentication.scopes` を使用して新しいスコープを追加するよりも簡単です。 `quarkus.oidc.authentication.scopes` はプロバイダー宣言によってすでに設定されているスコープをオーバーライドするため、この場合は必要なスコープをすべてリストする必要があります。

source: It is sometimes necessary to enable different validation constraints for the same class when it's passed to a different method.
ja_jp: 同じクラスが異なるメソッドに渡されたときに、異なる検証制約を有効にする必要があることがあります。

source: It is sometimes useful to narrow down the set of beans that can be obtained by programmatic lookup via `jakarta.enterprise.inject.Instance`. Typically, a user needs to choose the appropriate implementation of an interface based on a runtime configuration property.
ja_jp: `jakarta.enterprise.inject.Instance` を介したプログラムによる検索で取得できる Bean の集合を絞り込むことが有用な場合があります。典型的には，ユーザは，実行時設定プロパティに基づいて，インタフェースの適切な実装を選択する必要があります。

source: It is sometimes useful to narrow down the set of beans that can be obtained by programmatic lookup via `javax.enterprise.inject.Instance`. Typically, a user needs to choose the appropriate implementation of an interface based on a runtime configuration property.
ja_jp: `javax.enterprise.inject.Instance` を介したプログラムによるルックアップで取得できる Bean のセットを絞り込むと便利な場合があります。通常、ユーザーはランタイム設定プロパティーに基づいてインターフェイスの適切な実装を選択する必要があります。

source: It is sometimes useful to register an existing annotation that is not annotated with `@jakarta.enterprise.inject.Stereotype` as a CDI stereotype. This is similar to what CDI achieves through `BeforeBeanDiscovery#addStereotype()`. We are going to use `StereotypeRegistrarBuildItem` to get it done.
ja_jp: 場合によっては、 `@jakarta.enterprise.inject.Stereotype` でアノテーションされていない既存のアノテーションを CDI ステレオタイプとして登録しておきます。 これは CDI が `BeforeBeanDiscovery#addQualifier()` を通して実現していることに似ています。ここでは `QualifierRegistrarBuildItem` を使ってそれを実現しようとしています。

source: It is sometimes useful to register an existing annotation that is not annotated with `@javax.enterprise.inject.Stereotype` as a CDI stereotype. This is similar to what CDI achieves through `BeforeBeanDiscovery#addStereotype()`. We are going to use `StereotypeRegistrarBuildItem` to get it done.
ja_jp: 時には、 `@javax.inject.Qualifier` でアノテーションされていない既存のアノテーションをCDIステレオタイプとして登録しておくと便利かもしれません。これは CDI が `BeforeBeanDiscovery#addQualifier()` を通して実現していることに似ています。ここでは `QualifierRegistrarBuildItem` を使ってそれを実現しようとしています。

source: It is still "pure" Java, it is part of OpenJDK: your application runs on the JVM, with full access to Java features and libraries, without special configuration.
ja_jp: これは依然として「純粋な」Java であり、OpenJDK の一部です。アプリケーションは JVM 上で実行され、特別な設定なしに Java の機能とライブラリに完全にアクセスできます。

source: It is still experimental and we are very looking forward to your feedback.
ja_jp: これはまだ実験的な段階であり、皆様からのフィードバックをお待ちしております。

source: It is still possible to change the GC collection policy using GraalVM’s `-H:InitialCollectionPolicy` flag. Switching to the "space/time" policy can be done by passing the following via command line:
ja_jp: GraalVMの `-H:InitialCollectionPolicy` フラグを使用して、GCコレクションポリシーを変更することはまだ可能です。"space/time"ポリシーへの切り替えは、コマンドライン経由で以下を渡すことで行うことができます。

source: It is still very rough and the API will be subject to change but if you are interested in Loom's virtual threads, feel free to give it a try.
ja_jp: まだまだ荒削りで、APIも変更される可能性がありますが、Loomの仮想スレッドに興味を持たれた方は、お気軽に試してみてください。

source: It is super easy to do with https://github.com/quarkiverse[Quarkiverse] https://github.com/quarkiverse/quarkiverse-google-cloud-services[Google Cloud Services], only add the https://github.com/quarkiverse/quarkiverse-google-cloud-services/releases/latest[latest tag] service dependency, for example:
ja_jp: link:https://github.com/quarkiverse[Quarkiverse] のlink:https://github.com/quarkiverse/quarkiverse-google-cloud-services[Google Cloud Services] で行うのは超簡単で、 link:https://github.com/quarkiverse/quarkiverse-google-cloud-services/releases/latest[最新のタグ] サービスの依存関係を追加するだけです。例:

source: It is the default for newly created Quarkus projects and it can also be used for existing projects (see the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.31#new-quarkus-packaging-and-maven-lifecycle[migration guide] for more details).
ja_jp: これは新しく作成されるQuarkusプロジェクトのデフォルトであり、既存のプロジェクトでも使用できます（詳細については、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.31#new-quarkus-packaging-and-maven-lifecycle[移行ガイド] を参照してください）。

source: It is the developer's responsibility to ensure that the configuration of the datasource's `max-lifetime` property is less than the credentials expiration time.
ja_jp: データソースの `max-lifetime` プロパティの設定が、資格情報の有効期限よりも短いことを確認するのは、開発者の責任です。
